---
kind: method
id: M:Autodesk.Revit.DB.ClassificationEntry.HasBadLevel
source: html/69b9940f-9890-8aa7-c935-67c5c80b2f24.htm
---
# Autodesk.Revit.DB.ClassificationEntry.HasBadLevel Method

Checks if the level is an integer in range between 1 and 5 inclusive.

## Syntax (C#)
```csharp
public bool HasBadLevel()
```

## Returns
True if the level is not an integer from 1 to 5 inclusive. False otherwise.